Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Type parameter ''{0}'' is never used
zh_cn: 类型参数 ''{0}'' 从未使用

source: Type parameter ''{0}'' is not within its bound; should extend ''{1}''
zh_cn: 类型参数 ''{0}'' 不在其范围内;应该继承 ''{1}''

source: Type parameter ''{0}'' is not within its bound; should implement ''{1}''
zh_cn: 类型参数 ''{0}'' 不在其范围内;应该实现 ''{1}''

source: Type parameter cannot be followed by other bounds
zh_cn: 类型参数不能跟随其他边界

source: Type parameter expected
zh_cn: 期望类型参数

source: Type parameter name expected
zh_cn: 期望类型参数名称

source: Type parameters:
zh_cn: 类型参数:

source: Type the new name in the popup window that appears, or select one of the suggested names, and press Enter.
zh_cn: 在出现的弹窗中输入新的名字，或选择一个建议的名字，然后按 Enter。

source: Type...
zh_cn: 类型...

source: Type:
zh_cn: 类型:

source: Type:\&nbsp;{0}
zh_cn: 类型:\&nbsp;{0}

source: Types in multi-catch must be disjoint: ''{0}'' is a subclass of ''{1}''
zh_cn: 多个 catch 中的类型必须是不相交的：''{0}'' 是 ''{1}'' 的子类

source: Types matching pattern
zh_cn: 类匹配模式

source: Typing
zh_cn: 输入

source: Typing: "{0}"
zh_cn: 输入: "{0}"

source: UI Debugger...
zh_cn: UI 调试器...

source: UI Designer Form
zh_cn: UI 设计形式

source: UI Font Color
zh_cn: UI 字体颜色

source: UI Options
zh_cn: UI 选项

source: UI Settings
zh_cn: UI 设置

source: UI Usability Features
zh_cn: 用户界面的可用特性

source: UNDEFINED
zh_cn: 未定义

source: UNKNOWN
zh_cn: 未知

source: URI is not registered (Settings | Languages \& Frameworks | Schemas and DTDs)
zh_cn: URI 未注册 (Settings | Languages \& Frameworks | Schemas and DTDs)

source: URL/HTML &file:
zh_cn: URL/HTML 文件:(&F)

source: U_nsplit All
zh_cn: 取消所有分割(_N)

source: Un&scrambler:
zh_cn: 解码:(&S)

source: Un_split
zh_cn: 取消分割(_S)

source: Un_wrap/Remove...
zh_cn: 解除包围/移除...(_W)

source: Unable To Add Favorites List
zh_cn: 无法添加收藏夹列表

source: Unable To Save Settings
zh_cn: 无法保存设置

source: Unable to Add Action Without Icon to the Toolbar
zh_cn: 无法添加没有图标的操作到工具栏

source: Unable to Create Profile.
zh_cn: 无法创建配置文件。

source: Unable to Save Data
zh_cn: 无法保存数据

source: Unable to Use Local Scope
zh_cn: 无法应用为本地范围

source: Unable to contact license server
zh_cn: 无法联系许可证服务器

source: Unable to create a temporary file ({1}).
zh_cn: 无法创建临时文件({1})。

source: Unable to create file ''{0}''
zh_cn: 无法创建文件 ''{0}''

source: Unable to create temp directory ''{0}''
zh_cn: 无法创建临时目录 ''{0}''

source: Unable to delete an intermediate file ({1}).
zh_cn: 无法删除中间文件 ({1}) 。

source: Unable to discover license server url
zh_cn: 无法找到许可证服务器地址

source: Unable to evaluate capture key expression: {0}
zh_cn: 无法计算捕获键表达式：{0}

source: Unable to evaluate insert key expression: {0}
zh_cn: 无法计算插入键表达式：{0}

source: Unable to evaluate the expression
zh_cn: 不能计算表达式

source: Unable to import settings.
zh_cn: 无法导入设置 {0} 。

source: Unable to locate suitable application icon in ''{0}''.
zh_cn: 无法在 ''{0}'' 中找到合适的应用程序图标。

source: Unable to locate suitable startup script in ''{0}''.
zh_cn: 无法在 ''{0}'' 中找到合适的启动脚本。

source: Unable to open debugger port
zh_cn: 无法打开调试器端口

source: Unable to open project from ''{0}''
zh_cn: 无法从 ''{0}'' 打开项目

source: Unable to parse template "{0}" Error message: {1}
zh_cn: 无法解析模板 "{0}" 错误信息: {1}

source: Unable to perform an action since it changes read-only fragments of the current document
zh_cn: 无法执行操作，因为它会更改当前文档的只读片段

source: Unable to save settings.
zh_cn: 无法保存设置。

source: Unable to set up IDE profile for scope
zh_cn: 无法设置范围的 IDE 配置文件

source: Unable to start type migration
zh_cn: 无法启动类型迁移

source: Unable to switch profile
zh_cn: 无法切换配置文件

source: Unary operators (!, -, +, ++, --)
zh_cn: 一元运算符 (!, -, +, ++, --)

source: Unauthorized Operation
zh_cn: 未经授权的操作

source: Unbound XML namespace prefix
zh_cn: 未绑定的 XML 命名空间前缀

source: Unboxing of <code>#ref</code> #loc may produce <code>java.lang.NullPointerException</code>
zh_cn: <code>#ref</code> #loc 的拆箱可能产生 <code>java.lang.NullPointerException</code>

source: Uncaught excepti&on
zh_cn: 未捕获的异常(&O)

source: Unchecked assignment: ''{0}'' to ''{1}''
zh_cn: 未检查的赋值:''{0}'' 到 ''{1}''

source: Unchecked call to ''{0}'' as a member of raw type ''{1}''
zh_cn: 未检查的调用 ''{0}'' 作为原始类型 ''{1}'' 的成员

source: Unchecked cast: ''{0}'' to ''{1}''
zh_cn: 未检查的转换:''{0}'' 到 ''{1}''

source: Unchecked method ''{0}'' invocation
zh_cn: 未检查的方法 ''{0}'' 的调用

source: Unchecked overriding: return type requires unchecked conversion.
zh_cn: 未经检查的覆盖：返回类型需要未经检查的转换。

source: Unchecked warning
zh_cn: 未检查警告

source: Unclassified {0}
zh_cn: 未分类 {0}

source: Unclosed character literal
zh_cn: 未封闭的字符文字

source: Unclosed comment
zh_cn: 未封闭的注释

source: Uncomment the following property if no tests compilation is needed
zh_cn: 如果不需要测试编译，请取消注释以下属性

source: Uncommitted changes before {0}
zh_cn: {0} 之前未提交的更改

source: Undefined Path Variable
zh_cn: 未定义的路径变量

source: Undefined label: ''{0}''
zh_cn: 未定义的标签：''{0}''

source: Under construction
zh_cn: 正在构建

source: Under construction.
zh_cn: 正在构建。

source: Underscored
zh_cn: 下划线

source: Underscores in literals
zh_cn: 字符中的下划线

source: Underscores in numeric literals
zh_cn: 数字文字中的下划线

source: Underwaved
zh_cn: 波浪下划线

source: Undo
zh_cn: 撤消

source: Undo last navigation operation
zh_cn: 撤消上次导航操作

source: Undo {0}
zh_cn: 撤销 {0}

source: Unescaped \&
zh_cn: 未转义 \&

source: Unescaped \& or nonterminated character/entity reference
zh_cn: 未转义的 \& 或非终止字符/实体引用

source: Unescaped xml character
zh_cn: 未转义的 xml 字符

source: Unexpected ''{0}''
zh_cn: 不期望的 ''{0}''

source: Unexpected bound
zh_cn: 不期望的边界

source: Unexpected end of file
zh_cn: 异常文件结尾

source: Unexpected identifier
zh_cn: 不期望的标识符

source: Unexpected token
zh_cn: 不期望的标记

source: Unexpected tokens
zh_cn: 不期望的标记

source: Unexpected wildcard
zh_cn: 不期望的通配符

source: Unfortunately, the IDE is not capable of an automatic update on your system.
zh_cn: 不幸的是，IDE 无法在系统上自动更新。

source: Unfortunately, this doesn't work with the 'jsse.enableSNIExtension' property set to 'false', so the option was disabled.
zh_cn: 不幸的是，这不适用于 'jsse.enableSNIExtension' 属性设置为 'false' ，因此该选项被禁用。

source: Unfortunately, xdg-utils seem to be unavailable on your system.
zh_cn: 抱歉，xdg-utils 似乎在您的系统上不可用。

source: Unfreeze
zh_cn: 解冻

source: Ungroup Configurations
zh_cn: 取消分组配置

source: Unhandled Exception in JSP
zh_cn: JSP 中未处理的异常

source: Unhandled {1, choice, 0#exception|2#exceptions} from {2}: {0}
zh_cn: 未处理的异常从 {2}: {0}

source: Unhandled {1, choice, 0#exception|2#exceptions}: {0}
zh_cn: 未处理的异常: {0}

source: Unindent Line or Selection
zh_cn: 取消选中行或选中内容的缩进

source: Unindent:
zh_cn: 取消缩进:

source: Uninstall
zh_cn: 卸载

source: Union of {0} and {1}
zh_cn: {0} 和 {1} 的接合

source: Unit tests failed
zh_cn: 单元测试失败

source: Unit tests passed
zh_cn: 单元测试通过

# Unix and OS X ( )
source: Unix and OS X (\n)
zh_cn: Unix 和 OS X (\n)

source: Unknown
zh_cn: 未知的

source: Unknown HTML boolean tag attribute
zh_cn: 未知的 HTML 布尔标签属性

source: Unknown HTML tag
zh_cn: 未知的 HTML 标签

source: Unknown HTML tag attribute
zh_cn: 未知的 HTML 标签属性

source: Unknown Module Type
zh_cn: 未知模块类型

source: Unknown SDK
zh_cn: 未知 SDK

source: Unknown class: ''{0}''
zh_cn: 未知类：''{0}''

source: Unknown diff
zh_cn: 未知的差异

source: Unknown encoding: ''{0}''
zh_cn: 未知编码：''{0}''

source: Unknown enum value ''{0}''
zh_cn: 未知的枚举值 ''{0}''

source: Unknown error
zh_cn: 未知错误

source: Unknown expression type.
zh_cn: 未知的表达式类型。

source: Unknown external tool
zh_cn: 未知的外部工具

source: Unknown facet type: ''{0}''
zh_cn: 未知 facet 类型:''{0}''

source: Unknown file type: {0}
zh_cn: 未知文件类型:{0}

source: Unknown html tag {0}
zh_cn: 未知的 html 标签 {0}

source: Unknown module type.
zh_cn: 未知的模块类型。

source: Unknown task
zh_cn: 未知的任务

source: Unknown type {0}
zh_cn: 未知类型 {0}

source: Unknown version
zh_cn: 未知版本

source: Unlike accepting with the &shortcut:EditorChooseLookupItem; key, the selected name will overwrite the rest of the name to the right of the caret.
zh_cn: 不像 &shortcut:EditorChooseLookupItem; ，该操作会用所选名字覆盖插入符号右侧剩余的名字。

source: Unlimited
zh_cn: 无限

source: Unload All >
zh_cn: 卸载全部 >

source: Unload All Dependent Modules
zh_cn: 卸载所有依赖它的模块

source: Unload Dependent Modules
zh_cn: 卸载依赖它的模块

source: Unload Selected Modules Only
zh_cn: 只卸载所选模块

source: Unloaded modules
zh_cn: 卸载的模块

source: Unloading modules makes the IDE faster: search, refactoring and compilation skip unloaded modules.
zh_cn: 卸载模块使 IDE 更快：搜索，重构和编译跳过卸载的模块。

source: Unlock
zh_cn: 解锁

source: Unmark Object
zh_cn: 取消标记对象

source: Unmark Root
zh_cn: 取消根标记

source: Unmark Roots
zh_cn: 取消标记根

source: Unmark Source
zh_cn: 取消标记源

source: Unmark Tests
zh_cn: 取消标记测试

source: Unmark as {0}
zh_cn: 取消标记为 {0}

source: Unmute Breakpoints on Session Finish
zh_cn: 在会话完成时取消断点

source: Unnamed
zh_cn: 未命名

source: Unnamed{0}
zh_cn: 未命名的 {0}

source: Unnecessary ''{0}()'' call
zh_cn: 不必要的 ''{0}()'' 调用

source: Unnecessary module dependency
zh_cn: 不必要的模块依赖

source: Unp_in Active Tab
zh_cn: 取消固定活动选项卡(_I)

source: Unp_in Tab
zh_cn: 取消固定选项卡(_I)

source: Unparseable content
zh_cn: 无法解析的内容

source: Unqualified super reference is not allowed in extension method
zh_cn: 继承方法不允许不合格的 super 引用

source: Unreachable section: {1, choice, 0#exception|2#exceptions} ''{0}'' {1, choice, 0#has|2#have} already been caught
zh_cn: 无法访问的部分:异常 ''{0}'' 已经被捕获

source: Unreachable statement
zh_cn: 无法到达的语句

source: Unread.
zh_cn: 未读的。

source: Unresolved DTD reference
zh_cn: 未解决的 DTD 引用

source: Unresolved Dtd Element Reference {0}
zh_cn: 未解决的 Dtd 元素引用 {0}

source: Unresolved Entity Reference {0}
zh_cn: 未解决的实体引用 {0}

source: Unresolved ID
zh_cn: 未解决的 ID

source: Unroll loop
zh_cn: 展开循环

source: Unselect Occurrence
zh_cn: 取消选择匹配项

source: Unshelve Changes
zh_cn: 取消搁置更改

source: Unshelve Changes to Changelist
zh_cn: 不托管更改到更改列表

source: Unshelving Changes...
zh_cn: 取消搁置更改...

source: Unsplit Window
zh_cn: 不分割窗口

source: Unsupported characters for the charset ''{0}''
zh_cn: 字符集 ''{0}'' 的不支持的字符

source: Unsupported class version : {0}
zh_cn: 不支持的类版本 : {0}

source: Unsupported expression type
zh_cn: 不支持的表达式类型

source: Unsupported references found in {0} files
zh_cn: 在 {0} 个文件中找到的不支持的引用

source: Unsupported replacement pattern {0}
zh_cn: 不支持的替换模式 {0}

source: Untranslated property ''{0}''.
zh_cn: 非翻译属性 ''{0}''。

source: Unused Overriding Methods
zh_cn: 未使用的覆盖方法

source: Unused XML schema declaration
zh_cn: 未使用的 XML schema 声明

source: Unused assignment
zh_cn: 没有用的赋值

source: Unused declaration
zh_cn: 未使用的声明

source: Unused import
zh_cn: 未使用的导入

source: Unused import (editor light)
zh_cn: 未使用的导入 (editor light)

source: Unused import statement
zh_cn: 未使用的导入语句

source: Unused library
zh_cn: 未使用的库

source: Unused library ''{0}''
zh_cn: 未使用的库 ''{0}''

source: Unused method parameters
zh_cn: 未使用的方法参数

source: Unused roots {0} from library ''{1}''
zh_cn: 来自库 ''{1}'' 的未使用的根 {0}

source: Unused symbol
zh_cn: 未使用的符号

source: Unversioned Files
zh_cn: 未加入版本控制的文件

source: Unversioned:
zh_cn: 未受版本控制的:

source: Unwrap ''{0}''
zh_cn: 解开 ''{0}''

source: Unwrap 'anonymous...'
zh_cn: 解开 'anonymous...'

source: Unwrap 'else' branch
zh_cn: 解开 'else' 分支

source: Unwrap 'else' branch (changes semantics)
zh_cn: 解开 'else' 分支(改变语义)

source: Unwrap 'else...'
zh_cn: 解开 'else...'

source: Unwrap 'f ?
zh_cn: 解开 'f ?

source: Unwrap 'for...'
zh_cn: 解开 'for...'

source: Unwrap 'if...'
zh_cn: 解开 'if...'

source: Unwrap 'lambda...'
zh_cn: 解开 'lambda...'

source: Unwrap 'synchronized...'
zh_cn: 解开 'synchronized...'

source: Unwrap 'try...'
zh_cn: 解开 'try...'

source: Unwrap 'while...'
zh_cn: 解开 'while...'

source: Unwrap array initializer
zh_cn: 解开数组初始化

source: Unwrap braces
zh_cn: 解开括号

source: Up
zh_cn: 上

source: Up the stack trace
zh_cn: 向上堆栈跟踪

source: Up to date
zh_cn: 最新的

source: Up with Selection
zh_cn: 向上选中

source: Up&date Manually
zh_cn: 手动更新(&D)

source: Up&date and Restart
zh_cn: 更新并重启(&D)

source: Update
zh_cn: 更新

source: Update JDK configuration.
zh_cn: 更新 JDK 配置。

source: Update Plugin
zh_cn: 更新插件

source: Update Project
zh_cn: 更新项目

source: Update Project ({0})
zh_cn: 更新项目 ({0})

source: Update all properties files in &Resource bundle
zh_cn: 更新资源包中的所有属性文件(&R)

source: Update background-image size
zh_cn: 更新背景图像大小

source: Update canceled
zh_cn: 更新取消

source: Update channel switched to ''{0}''
zh_cn: 更新频道切换到 ''{0}''

source: Update from VCS
zh_cn: 从 VCS 更新

source: Update installed plugin from version {0}
zh_cn: 更新安装的插件版本 {0}

source: Update tag with Emmet
zh_cn: 用 Emmet 更新标签

source: Update the file in the corresponding artifacts
zh_cn: 更新相应构件中的文件

source: Update to version {1} or higher.
zh_cn: 请更新到 {1} 或更高版本。

source: Update {0}
zh_cn: 更新 {0}

source: Updated
zh_cn: 更新的

source: Updated from server
zh_cn: 从服务器更新

source: Updates
zh_cn: 更新

source: Updating Indices
zh_cn: 正在更新索引

source: Updating Module Tree
zh_cn: 更新模块树

source: Updating caches...
zh_cn: 更新缓存...

source: Updating done
zh_cn: 更新完成

source: Updating: {0}
zh_cn: 正在更新:{0}

source: Uploading SSH key to the cloud
zh_cn: 上传 SSH 密钥到云

source: Url is empty
zh_cn: Url 为空

source: Usage After
zh_cn: 使用后

source: Usage Before
zh_cn: 使用前

source: Usage Delta
zh_cn: 使用变化

source: Usage Example
zh_cn: 使用示例

source: Usage Scope
zh_cn: 使用范围

source: Usage View
zh_cn: 用法视图

source: Usage View: Imports
zh_cn: 使用视图：导入

source: Usage in .class
zh_cn: 在 .class 中的使用

source: Usage in cast target type
zh_cn: 在转换目标类型中的使用

source: Usage in comments
zh_cn: 在注释中的使用

source: Usage in extends/implements clause
zh_cn: 在 extends/implements 语句中的使用

source: Usage in import
zh_cn: 在导入中的使用

source: Usage in instanceof
zh_cn: instanceof 中的使用

source: Usage in string constants
zh_cn: 在字符串常量中的使用

source: Usage of API documented as @since {0}+
zh_cn: 使用了文档为 @since {0} 的 API

source: Usage of API marked for removal
zh_cn: 已标记为删除的 API 的使用

source: Usage of generified after 1.6 API which would cause compilation problems with JDK {0}
zh_cn: 1.6 以后的 API 的泛型的使用,JDK {0} 会造成编译问题

source: Usage of service ''{0}'' is not declared in module-info
zh_cn: 服务 ''{0}'' 的使用未在 module-info 中声明

source: Usage of service not declared in module-info
zh_cn: 未在 module-info 中声明的服务的使用

source: Usage: {0} diff <left file> <right file> [<base file>]
zh_cn: 用法: {0} diff <left file> <right file> [<base file>]

source: Usage: {0} merge <left file> <right file> [<base file>] <output file>
zh_cn: 用法: {0} merge <left file> <right file> [<base file>] <output file>

source: Usages
zh_cn: 使用

source: Usages Detected
zh_cn: 检测到使用

source: Usages in generated code
zh_cn: 生成代码中的使用

source: Usages of &classes and interfaces
zh_cn: 类和接口的使用(&C)

source: Usages of &fields
zh_cn: 字段的使用(&F)

source: Usages of &methods
zh_cn: 方法的使用(&M)

source: Usages of API which isn't available at the configured language level
zh_cn: 在配置的语言级别不可用的 API 的使用

source: Usages of package ''{0}'' in package ''{1}''
zh_cn: 在包 ''{1}'' 中,包 ''{0}'' 的使用

source: Usages of the left tree scope selection in the right tree scope selection
zh_cn: 左树选择范围在右树选择范围中的使用

source: Usages of the right tree scope selection in the left tree scope selection
zh_cn: 右树选择范围在左树选择范围中的使用

source: Usages of {0} {1} not found
zh_cn: 没有找到被 {0}{1} 的使用

source: Use "-J" prefix to specify JVM arguments
zh_cn: 使用 "-J" 前缀来指定 JVM 参数

source: Use "CamelHumps" words
zh_cn: 使用 "驼峰" 词

source: Use &external annotations
zh_cn: 使用外部注释(&E)

source: Use &getters during code generation
zh_cn: 在代码生成期间使用 getter(&G)

source: Use ''Collectors.{0}'' collector
zh_cn: 使用 ''Collectors.{0}'' collector

source: Use ''{0}'' method with functional argument
zh_cn: 使用带有功能参数的 ''{0}'' 方法

source: Use ''{0}'' method without lambda
zh_cn: 使用没有 lambda 的 ''{0}'' 方法

source: Use &shortcut:EditorCompleteStatement; to complete a current statement such as if, do-while, try-catch, return (or a method call) into a syntactically correct construct (e.g. add curly braces).
zh_cn: 使用 &shortcut:EditorCompleteStatement; 来把当前语句(如 if, do-while, try-catch, return (或方法调用))补全为语法正确的结构(比如加上大括号)。 。

source: Use &shortcut:FindNext; and &shortcut:FindPrevious; keys to navigate through highlighted usages.
zh_cn: 使用 &shortcut:FindNext; 和 &shortcut:FindPrevious; 在高亮使用间导航。

source: Use &shortcut:GotoNextError;/&shortcut:GotoPreviousError; keys to jump between highlighted syntax errors.
zh_cn: 使用 &shortcut:GotoNextError;/&shortcut:GotoPreviousError; 在高亮的语法错误间跳转。

source: Use &shortcut:HighlightUsagesInFile; (Edit | Find | Highlight Usages in File) to quickly highlight usages of some variable in the current file.
zh_cn: 使用 &shortcut:HighlightUsagesInFile; (Edit | Find | Highlight Usages in File) 来在当前文件中快速高亮一些变量的使用。

source: Use &shortcut:HippieBackwardCompletion; to do same in reverse order.
zh_cn: 使用 &shortcut:HippieBackwardCompletion; 来反向执行相同的操作。

source: Use &shortcut:InsertLiveTemplate; to complete any valid Live Template abbreviation if you don't remember it.
zh_cn: 如果你不记得完整缩写的话，可以使用 &shortcut:InsertLiveTemplate; 来补全任何有效的 Live Template（代码模板） 缩写。

source: Use &shortcut:MethodUp; and &shortcut:MethodDown; keys to quickly move between methods in the editor.
zh_cn: 使用 &shortcut:MethodUp; 和 &shortcut:MethodDown; 可以在编辑器中的方法间快速移动。

source: Use &shortcut:PreviousOccurence;/&shortcut:NextOccurence; shortcuts to jump between compiler error messages or search operation results.
zh_cn: 使用 &shortcut:PreviousOccurence;/&shortcut:NextOccurence; 在编译错误消息或搜索操作结果之前跳转。

source: Use &shortcut:QuickImplementations; (View | Quick Definition), to quickly review definition or content of the symbol at caret, without the need to open it in a new editor tab.
zh_cn: 使用 &shortcut:QuickImplementations; (View | Quick Definition)，可以快速查看插入符所在处的符号的定义或内容，而无需在新的编辑器选项卡中打开它。

source: Use &shortcut:RecentChanges; to quickly review your recent changes to the project.
zh_cn: 使用 &shortcut:RecentChanges; 快速查看项目中最的的更改。

source: Use &shortcut:ShowIntentionActions; to see the list of available actions.
zh_cn: 使用 &shortcut:ShowIntentionActions; 查看可用的操作列表。

source: Use &shortcut:ShowNavBar; keyboard shortcut to show the navigation bar, and arrow keys to locate the necessary files or folders.
zh_cn: 使用 &shortcut:ShowNavBar; 显示导航栏，然后用方向键定位文件或文件夹。

source: Use Analyze | Inspect Code to run code analysis for the whole project or a custom scope and examine the results in a friendly view.
zh_cn: 使用 Analyze | Inspect Code 来运行整个项目或自定义范围内的代码分析，并以友好的视图检查结果。

source: Use Analyze | Locate Duplicates to find repetitive blocks of code in a single file, a project, a module, or a custom scope.
zh_cn: 使用 Analyze | Locate Duplicates 可以在一个文件、项目、模块或自定义范围内查找重复的代码块。

source: Use Basic Completion (&shortcut:CodeCompletion;) for completing words in text and comments in files of many different types.
zh_cn: 使用 Basic Completion(基本补全) (&shortcut:CodeCompletion;) 补全文本中的单词及很多种不同类型的文件的注释。

source: Use Basic Completion (&shortcut:CodeCompletion;) within HTML, CSS and other files, for completing image file names.
zh_cn: 在 HTML， CSS 和其他文件中，使用Basic Completion(基本补全) (&shortcut:CodeCompletion;) 来补全图片文件名。

source: Use Code | Reformat Code to reformat code according to your code style preferences (File | Settings | Code Style).
zh_cn: 使用 Code | Reformat Code 来根据你的代码样式(File | Settings | Code Style) 格式化代码。

source: Use Refactor | Copy to create a class which is a copy of the selected class.
zh_cn: 使用 Refactor | Copy 来创建所选类的副本。

source: Use type hinting to inform PyCharm about the expected types of parameters, local variables, fields, or return values.
zh_cn: 使用 type hinting 来通知 PyCharm 提示期望的参数类型、局部变量、字段或返回值。

source: Use &shortcut:ActivateChangesToolWindow; keyboard shortcut to show or hide this tool window.
zh_cn: 使用 &shortcut:ActivateChangesToolWindow; 来显示或隐藏该工具窗口。

source: Use &shortcut:ActivateVersionControlToolWindow; keyboard shortcut to show or hide this tool window.
zh_cn: 使用 &shortcut:ActivateVersionControlToolWindow; 来显示或隐藏该工具窗口。

source: Use Space for toggling IDE settings.
zh_cn: 使用 Space 切换 IDE 设置。

source: Use @throws rather than @exception
zh_cn: 用 @throws 而不是 @exception

source: Use Abstract Method Implementation
zh_cn: 使用抽象方法实现

source: Use Arrays.asList() to wrap arrays
zh_cn: 使用 Arrays.asList() 来包装数组

source: Use Interface Where Possible
zh_cn: 尽可能使用接口

source: Use Interface _Where Possible...
zh_cn: 尽可能使用接口...(_W)

source: Use Introduce Variable to quickly declare variables
zh_cn: 使用引入变量以快速声明变量

source: Use JDK definitions from project files
zh_cn: 使用项目文件定义的 JDK

source: Use Soft Wraps
zh_cn: 启用自动换行

source: Use Soft Wraps in Preview Editor
zh_cn: 在编辑器预览中使用自动换行

source: Use a stable release version.
zh_cn: 请使用稳定版本。

source: Use alternative &JRE:
zh_cn: 使用替代 JRE：(&J)

source: Use anti-aliased font
zh_cn: 使用抗锯齿字体

source: Use arrows to select the file, and Enter to jump to it.
zh_cn: 使用箭头选择文件，Enter 跳转到该文件。

source: Use arrows to select the symbol, and Enter to jump to its declaration.
zh_cn: 使用箭头选择符号，Enter 跳转到其声明。

source: Use arrows to select the type, and Enter to jump to it.
zh_cn: 使用箭头选择类型，然后 Enter 跳转到该类型。

source: Use block caret
zh_cn: 使用块插入符

source: Use c&ustom Ant:
zh_cn: 使用自定义的 Ant:(&U)

source: Use classpath of m&odule:
zh_cn: 使用模块的类路径：(&O)

source: Use color scheme TODO default colors
zh_cn: TODO 使用默认颜色方案

source: Use color scheme font instead of the
zh_cn: 使用颜色方案字体代替

source: Use compiler from module target JDK when possible
zh_cn: 尽可能使用模块目标 JDK 的编译器

source: Use compiler:
zh_cn: 使用编译器:

source: Use console font instead of the
zh_cn: 使用控制台字体代替

source: Use constructor ''{0}''
zh_cn: 使用构造函数 ''{0}''

source: Use context menus to invoke comparison commands.
zh_cn: 使用上下文菜单调用比较命令。

source: Use current IDEA instance for idea.home property
zh_cn: 为 idea.home 属性使用当前的 IDEA 实例

source: Use current mode (toggled in the Reformat Code dialog)
zh_cn: 使用当前模式(在重新格式化代码对话框中切换)

source: Use default indent options (General)
zh_cn: 使用默认缩进选项(常规)

source: Use default renderer
zh_cn: 使用默认的渲染器

source: Use either a slash or a backslash as a delimiter.
zh_cn: 使用斜杠或反斜杠作为分隔符。

source: Use equals()
zh_cn: 使用 equals()

source: Use existing field ''{0}''?
zh_cn: 使用现有字段 ''{0}''？

source: Use existing implementation of ''{0}''
zh_cn: 使用 ''{0}'' 的现有实现

source: Use external merge tool:
zh_cn: 使用外部合并工具:

source: Use external tool to compare files:
zh_cn: 使用外部工具来比较文件:

source: Use external tool to compare folders:
zh_cn: 使用外部工具来比较文件夹:

source: Use following expression:
zh_cn: 使用下列表达式：

source: Use fully qualified class names
zh_cn: 使用完全限定的类名

source: Use fully qualified class names in JavaDoc:
zh_cn: 在 JavaDoc 中使用完全限定的类名：

source: Use fully qualified class names in javadoc
zh_cn: 在 javadoc 中使用完全限定的类名

source: Use global code style
zh_cn: 使用全局代码样式

source: Use indents relative to expression start
zh_cn: 相对于表达式的开始使用缩进

source: Use inherited attributes
zh_cn: 使用继承属性

source: Use interface/superclass in instanceof
zh_cn: 在 instanceof 中使用接口/超类

source: Use list of expressions:
zh_cn: 使用表达式列表：

source: Use method ''{0}''
zh_cn: 使用方法 ''{0}''

source: Use module compile output path
zh_cn: 使用模块编译输出路径

source: Use of '_' as a lambda parameter name is not allowed
zh_cn: 不允许使用 '_' 作为 lambda 的参数名称

source: Use of '_' as an identifier might not be supported in releases after Java 8
zh_cn: 在 Java 8 之后的版本中可能不支持使用 '_' 作为标识符

source: Use of <code>#ref</code> #loc would need unboxing which may produce <code>java.lang.NullPointerException</code>
zh_cn: <code>#ref</code> #loc 的使用需要拆箱，可能产生 <code>java.lang.NullPointerException</code>

source: Use one of constructor overloads
zh_cn: 使用构造函数重载之一

source: Use one of method overloads
zh_cn: 使用方法重载之一

source: Use original line's indent for wrapped parts
zh_cn: 自动换行使用原始行的缩进

source: Use other items in the list to surround with other constructs.
zh_cn: 使用列表中的其他项目可以用其他结构环绕。

source: Use per-project code style scheme
zh_cn: 使用单个项目的代码样式方案

source: Use project &default Ant:
zh_cn: 使用项目默认 Ant:(&D)

source: Use secure connection
zh_cn: 使用安全连接

source: Use selected &value
zh_cn: 使用所选值(&V)

source: Use single class import
zh_cn: 使用单个类导入

source: Use soft wraps in console
zh_cn: 在控制台使用自动换行

source: Use soft wraps in editor
zh_cn: 在编辑窗口使用自动换行

source: Use static &import if possible
zh_cn: 如果可能，使用静态导入(&I)

source: Use static import for ''{0}''
zh_cn: 为 ''{0}'' 使用静态导入
